from typing import Literal

TeamCode = Literal["LG","HH","SK","SS","KT","LT","NC","HT","OB","WO"]

PITCHER_HEADERS = [
    "ERA","G","CG","SHO","W","L","SV","HLD","WPCT","TBF","NP","IP","H",
    "2B","3B","HR","SAC","SF","BB","IBB","SO","WP","BK","R","ER","BSV",
    "WHIP","AVG","QS"
]

HITTER_HEADERS = [
    "AVG","G","PA","AB","R","H","2B","3B","HR","TB","RBI","SB","CS",
    "SAC","SF","BB","IBB","HBP","SO","GDP","SLG","OBP","E","SB%","MH",
    "OPS","RISP","PH-BA"
]

TEAM_HEADERS = ["순위","팀명","경기","승","패","무","승률","게임차","최근10경기","연속","홈","방문"]

TEAM_MAP = {
    "LG":"LG","엘지":"LG",
    "한화":"HH",
    "SSG":"SK","쓱":"SK",
    "삼성":"SS",
    "KT":"KT","케이티":"KT",
    "롯데":"LT","자이언츠":"LT",
    "KIA":"HT","기아":"HT",
    "NC":"NC","엔씨":"NC",
    "두산":"OB",
    "키움":"WO"
}

STAT_ALIASES = {
    #선수
    "id": "id",
    "이름": "이름",
    "번호": "등번호","등번호": "등번호",
    "생년월일": "생년월일","생일": "생년월일",
    "포지션": "포지션",
    "신체": "신체",
    "경력": "경력",
    "연봉": "연봉",
    "드래프트": "드래프트","드래프트 순위": "드래프트",

    # 타자
    "타율": "AVG",
    "경기수": "G",
    "타석": "PA",
    "타수": "AB",
    "득점": "R",
    "안타": "H",
    "2루타": "2B",
    "3루타": "3B",
    "홈런": "HR",
    "루타": "TB",
    "타점": "RBI",
    "도루": "SB",
    "도루실패": "CS",
    "희생번트": "SAC",
    "희생플라이": "SF",
    "볼넷": "BB",
    "고의4구": "IBB",
    "사구": "HBP",
    "삼진": "SO",
    "병살타": "GDP",
    "장타율": "SLG",
    "출루율": "OBP",
    "에러": "E", "실책": "E",
    "도루성공률": "SB%",
    "멀티히트": "MH",
    "OPS": "OPS",
    "득점권타율": "RISP",
    "대타타율": "PH-BA",

    # 투수
    "평균자책점": "ERA","평자":"ERA",
    "승": "W",
    "패": "L",
    "세이브": "SV",
    "홀드": "HLD",
    "승률": "WPCT",
    "타자수": "TBF",
    "투구수": "NP",
    "이닝": "IP",
    "피안타": "H",
    "피2루타": "2B",
    "피3루타": "3B",
    "피홈런": "HR",
    "희생번트허용": "SAC",
    "희생플라이허용": "SF",
    "볼넷허용": "BB",
    "고의4구": "IBB",
    "탈삼진": "SO",
    "폭투": "WP",
    "보크": "BK",
    "실점": "R",
    "자책점": "ER",
    "블론세이브": "BSV", "블론": "BSV",
    "이닝당출루허용률": "WHIP",
    "피안타율": "AVG",
    "퀄리티스타트": "QS",


    #팀
    "순위": "순위", "팀 순위": "순위",
    "승": "승",
    "패": "패",
    "무": "무",
    "승률": "승률",
    "게임차": "게임차",
    "최근10경기": "최근10경기",
    "연속": "연속", "연승": "연속", "연패": "연속",
    "홈": "홈", "홈 성적": "홈",
    "방문": "방문", "원정": "방문", "원정 성적": "방문", 
}

PROFILE_LABELS = ["이름","등번호","생년월일","포지션","신체","경력","연봉","드래프트"]

GOOD_GAMES = [  
    "5/21 vs LG - 이민석 첫 선발승, 고승민 홈런",
    "5/25 vs 한화 - 9회말 2아웃 전준우 동점 홈런",
    "6/12 vs KT - 장두성의 투혼투지",
    "6/18 vs 한화 - 홍민기 선발 박재엽 홈런",
    "6/22 vs 삼성 - 홍민기 3이닝 무실점, 역전승",
    "8/2 vs 키움 - 9회초 전준우 동점 적시타 김민성 역전 적시타",
    "8/24 vs NC - 12연패 탈출" 
]